"""
Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
Тобто, в результаті повинен вийти список із 2-х списків.
Якщо в початковому списку непарна кількість елементів,
то в першому списку має бути більше елементів.
Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.
Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній,
у списку парна кількість елементів і в списку непарна кількість елементів.

Приклади:
Було => стало

[1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
[1, 2, 3] => [[1, 2], [3]]
[1, 2, 3, 4, 5] => [[1, 2, 3], [4, 5]]
[1] => [[1], []]
[] => [[], []]
"""

# lst = [1, 2, 3, 4, 5, 6]
# lst = [1, 2, 3]
# lst = [1, 2, 3, 4, 5]
# lst = [1]
lst = []
new_lst = []

if len(lst) % 2 == 0:
    init_index = int(len(lst) / 2)
    new_lst = [lst[:init_index], lst[init_index:]]
    print(new_lst)
else:
    init_index = int(len(lst) / 2)
    new_lst = [lst[:init_index+1], lst[init_index+1:]]
    print(new_lst)
