"""
Ваша програма має перенести останній елемент списку з кінця на початок,
тобто, останній елемент списку має стати першим.
Послідовність інших елементів не має змінюватися.
Порожній список або список з одним елементом повинен залишитися незмінним.
Кількість елементів у списку може бути будь-яким – нуль та більше!

Приклади:
[12, 3, 4, 10] => [10, 12, 3, 4]
[1] => [1]
[] => []
[12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]
"""

# lst = [12, 3, 4, 10]
# lst = [1]
# lst = []
# lst = [12, 3, 4, 10, 8]

if not lst or len(lst) == 1:
    print(lst)
else:
    lst_length = len(lst)
    last_value = lst[lst_length-1]
    lst.remove(last_value)
    lst.insert(0, last_value)
    print(lst)
