"""
Ваше завдання — написати програму,
яка перемножує всі цифри, введені користувачем цілого числа, поки воно не стане менше або дорівнювати 9.
Користувач вводить число з клавіатури.

Приклади:
# Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729,
#Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
999 -> 2
1000 -> 0
423 -> 8
33 -> 9
25 -> 0
1 -> 1
"""

input_num = int(input("Please enter an integer "))

# input_num = 99 #-> 2
# input_num = 1000 #-> 0
# input_num = 423 #-> 8
# input_num = 33 #-> 9
# input_num = 25 #-> 0
# input_num = 1 #-> 1


while input_num > 9:
    result = 1
    for num in str(input_num):
        result *= int(num)
    input_num = result
print(input_num)