"""
Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
Ну і додатковим завданням є турбота про виведення.
Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні
заповнюватися нулями при одноцифрових значеннях.
Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек.
Тобто використовуючи функцію divmod або методи поділу // і %
вам необхідно знайти відповідну кількість днів, годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)
Доповнити провідними нулями можна за допомогою методу zfill(2)

Приклад:
0 -> 0 днів, 00:00:00
224930 -> 2 дні, 14:28:50
466289 -> 5 днів, 09:31:29
950400 -> 11 днів, 00:00:00
1209600 -> 14 днів, 00:00:00
1900800 - > 22 дні, 00:00:00
8639999 -> 99 днів, 23:59:59
22493 -> 0 днів, 06:14:53
7948799 -> 91 день, 23:59:59
"""

input_sec = 0 #-> 0 днів, 00:00:00
# input_sec = 224930 #-> 2 дні, 14:28:50
# input_sec = 466289 #-> 5 днів, 09:31:29
# input_sec = 950400 #-> 11 днів, 00:00:00
# input_sec = 1209600 #-> 14 днів, 00:00:00
# input_sec = 1900800 #-> 22 дні, 00:00:00
# input_sec = 8639999 #-> 99 днів, 23:59:59
# input_sec = 22493 #-> 0 днів, 06:14:53
# input_sec = 7948799 #-> 91 день, 23:59:59

days = 0
hours = 0
minutes = 0
seconds = 0
day_name = ""

sec_in_minutes = 60
sec_in_hours = 60 * 60
sec_in_day = 60 * 60 * 24

if 0 <= input_sec < 8640000:
    days, tmp = divmod(input_sec, sec_in_day)
    hours, tmp = divmod(tmp, sec_in_hours)
    minutes, seconds = divmod(tmp, sec_in_minutes)

day_type = {0: "днів", 1:"день", 2: "дні", 3: "дні", 4: "дні"}

if 11 <= days % 100 <=14:
    day_name = day_type[0]
else:
    day_name = day_type.get(days % 10, "днів")

print(f"{days} {day_name}, {str(hours).zfill(2)}:{str(minutes).zfill(2)}:{str(seconds).zfill(2)}")
