"""
Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
потім перемножити цю суму на останній елемент вхідного масиву.
Не забудьте, що перший елемент масиву має індекс 0.
Для порожнього масиву результат завжди 0.

Пояснення:
[0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88
[1, 3, 5] => 30
[6] => 36
[] => 0
"""

lst = [0, 1, 7, 2, 4, 8]
# lst = [1, 3, 5]
# lst = [6]
# lst = []

math_result = 0

for i, el in enumerate(lst):
    if lst and i % 2 == 0:
        math_result += el
    if i == len(lst)-1:
        math_result *= lst[i]
print(math_result)

# дуже сподобалось таке використання :)
print(sum(lst[::2]) * lst[-1] if lst else 0)

